<a href="https://colab.research.google.com/github/noe96cr/Caso-3/blob/main/Caso_de_estudio_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#1. Importar CSV en Python

In [245]:
# Se conecta con GoogleDrive
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [246]:
# Se cargan las librerias necesarias
import numpy as np
import pandas as pd


# Se cargan los datos adquiridos
# df = dataframe
df1 = pd.read_csv('drive/MyDrive/Caso#3/datosSinProcesar/data.csv' , sep=';')

# CABE DESTACAR QUE:
# Cada paso guarda el DataFrame en una variable diferente, con la intencion de saber
# en que paso se esta ubicado, por ejemplo, el paso #9 tendria df9, mientras que
# el paso #3 tendria df3.

#2. Primeros 5 valores del dataframe

In [247]:
df2 = df1


# Se imprimen las 5 primeras filas con todas sus columnas y valores.
df2.head()

   id    FirstName LastName  ... HourlyRate MaritalStatus OverTime
0   1    Kimberley    Kuhic  ...         40        Single      Yes
1   1        Kitty  Ruecker  ...         76       Married       No
2   5        Jamal     Cole  ...         89        Single      Yes
3   5  Christopher  D'Amore  ...         78       Married       No
4   5        Carly    Ratke  ...         86        Single      Yes

[5 rows x 12 columns]

#3. Últimos 5 valores del dataframe

In [248]:
df3 = df2


# Se imprimen las 5 ultimas filas con todas sus columnas y valores.
df3.tail()

      id FirstName  LastName  ... HourlyRate MaritalStatus OverTime
995  996    Linnie    Larson  ...         92        Single      Yes
996  997    Agusta  Emmerich  ...         91      Divorced       No
997  997    Andrew  Schulist  ...         34        Single       No
998  997     Brook    Turner  ...         49       Married       No
999  999     Maceo    Wisoky  ...         33       Married       No

[5 rows x 12 columns]

#4. Tipo de dato de cada columna

In [249]:
df4 = df3


# Se imprime cada columna de lado izquierdo, y a su derecha el tipo de dato a que corresponde.
df4.dtypes

id                 int64
FirstName         object
LastName          object
Gender            object
Birthday          object
Status            object
Salary           float64
Taxes             object
Department        object
HourlyRate        object
MaritalStatus     object
OverTime          object
dtype: object

#5. Cantidad de valores nulos por columna

In [250]:
df5 = df4


# Nuevamente el nombre de la columna de lado izquierdo, y a su derecha la cantidad de NaN que tiene dicha columna.
df5.isnull().sum()

id                 0
FirstName          2
LastName           2
Gender           207
Birthday           2
Status           178
Salary             2
Taxes            993
Department        12
HourlyRate         2
MaritalStatus     25
OverTime           2
dtype: int64

# 6. Porcentaje total de valores perdidos en todo el dataframe

In [251]:
df6 = df5


# Se divide la cantidad de valores NaN de todo el DataFrame entre todos los datos del DataFrame,
# Luego se multiplica por 100, para que el valor sea un porcentaje.
(df6.isnull().sum().sum()/df6.count().sum().sum())*100

13.496642390995934

#7. Porcentaje de valores perdidos por columna

In [252]:
df7 = df6


# Igual que el paso anterior, pero, en este caso no se da un resultado total del DataFrame, sino
# que se da el resultado por columna.
(df7.isnull().sum()/(df7.count()+df7.isnull().sum()))*100

id                0.0
FirstName         0.2
LastName          0.2
Gender           20.7
Birthday          0.2
Status           17.8
Salary            0.2
Taxes            99.3
Department        1.2
HourlyRate        0.2
MaritalStatus     2.5
OverTime          0.2
dtype: float64

#8. Eliminar columna que tenga más de 70% de valores nulos

In [253]:
df8 = df7


# Ya que en el paso anterior se observa que la columna Taxes tiene casi un 100% de valores NaN
# Entonces se procede a eliminar esa columna
print(df7)
del df7['Taxes']

      id    FirstName  LastName  ... HourlyRate MaritalStatus OverTime
0      1    Kimberley     Kuhic  ...         40        Single      Yes
1      1        Kitty   Ruecker  ...         76       Married       No
2      5        Jamal      Cole  ...         89        Single      Yes
3      5  Christopher   D'Amore  ...         78       Married       No
4      5        Carly     Ratke  ...         86        Single      Yes
..   ...          ...       ...  ...        ...           ...      ...
995  996       Linnie    Larson  ...         92        Single      Yes
996  997       Agusta  Emmerich  ...         91      Divorced       No
997  997       Andrew  Schulist  ...         34        Single       No
998  997        Brook    Turner  ...         49       Married       No
999  999        Maceo    Wisoky  ...         33       Married       No

[1000 rows x 12 columns]

#9. Eliminar filas con menos de dos elementos

In [254]:
df9 = df8


# En este paso obtenemos aquellas filas que tienen más de 2 elementos NaN en su fila. 
# Luego eliminamos esas filas y volvemos a comprobar que ninguna fila cuenta con más de 2 columnas con NaN.
a = df8.isnull().sum(axis=1)

In [255]:
print(a[a>2])

182    10
239     3
592    10
dtype: int64

In [256]:
df9 = df8.drop([182, 239, 592],axis=0)

In [257]:
a = df9.isnull().sum(axis=1)

In [258]:
print(a[a>2])

Series([], dtype: int64)

#10. Reemplace los String “--" por valores nulos

In [259]:
df10 = df9


# Se comprueba que efectivamente hay valores "--". Como en la primer fila el Status tiene "--"
df9.head()

   id    FirstName LastName  ... HourlyRate MaritalStatus OverTime
0   1    Kimberley    Kuhic  ...         40        Single      Yes
1   1        Kitty  Ruecker  ...         76       Married       No
2   5        Jamal     Cole  ...         89        Single      Yes
3   5  Christopher  D'Amore  ...         78       Married       No
4   5        Carly    Ratke  ...         86        Single      Yes

[5 rows x 11 columns]

In [260]:
# Se realiza el codigo, reemplazando los valores "--" por NaN
df10 = df9.replace("--", np.nan)

In [261]:
df10.head()
# De esta forma se observa que la primer persona quien anteriormente tenía un Status = "--" Ahora
# tiene NaN, por lo tanto, sí funcionó.

   id    FirstName LastName  ... HourlyRate MaritalStatus OverTime
0   1    Kimberley    Kuhic  ...         40        Single      Yes
1   1        Kitty  Ruecker  ...         76       Married       No
2   5        Jamal     Cole  ...         89        Single      Yes
3   5  Christopher  D'Amore  ...         78       Married       No
4   5        Carly    Ratke  ...         86        Single      Yes

[5 rows x 11 columns]

#11. Reemplazar los valores nulos de la columna de “Gender” por U (Unknown) para aquellos empleados que no especificaron este campo.

In [262]:
df11 = df10

In [263]:
df11['Gender'].fillna("U", inplace=True)

In [264]:
df11.isnull().sum()
# De esta forma se comprueba que Gender quedó con 0 NaN.

id                 0
FirstName          0
LastName           0
Gender             0
Birthday           0
Status           186
Salary             0
Department        10
HourlyRate        25
MaritalStatus     22
OverTime           0
dtype: int64

#12. Reemplazar los valores nulos de la columna “Departamento” por “Bench”

In [265]:
df12 = df11

In [266]:
df12['Department'].fillna("Bench", inplace=True)

In [267]:
df12.isnull().sum()
# De esta forma se comprueba que Department quedó con 0 NaN.

id                 0
FirstName          0
LastName           0
Gender             0
Birthday           0
Status           186
Salary             0
Department         0
HourlyRate        25
MaritalStatus     22
OverTime           0
dtype: int64

#13. Reemplazar los valores nulos de la columna “HourlyRate” por la mediana

In [268]:
df13 = df12

In [269]:
median=df13.median(skipna=True)

In [270]:
print(median)

id               492.0
Salary        101162.0
HourlyRate        67.0
dtype: float64

In [271]:
df13['HourlyRate'].fillna(67, inplace=True)

In [273]:
df13.isnull().sum()
# De esta forma se comprueba que HourlyRate quedó con 0 NaN.

id                 0
FirstName          0
LastName           0
Gender             0
Birthday           0
Status           186
Salary             0
Department         0
HourlyRate         0
MaritalStatus     22
OverTime           0
dtype: int64

#14. Reemplazar los valores perdidos inesperados de la columna “Overtime” por No

In [274]:
df14 = df13

In [275]:
# Se comprueba cuantos valores NaN tiene la columna OverTime antes del paso 9.
df8.isnull().sum()

id                 0
FirstName          2
LastName           2
Gender           207
Birthday           2
Status           178
Salary             2
Department        12
HourlyRate         2
MaritalStatus     25
OverTime           2
dtype: int64

In [276]:
# Se comprueba cuantos valores NaN tiene la columna OverTime despues del paso 9.
df9.isnull().sum()

id                 0
FirstName          0
LastName           0
Gender           204
Birthday           0
Status           175
Salary             0
Department        10
HourlyRate         0
MaritalStatus     22
OverTime           0
dtype: int64

In [277]:
# La columna OverTime no cuenta con ningun valor NaN, de hecho analizando el codigo, nos dimos 
# cuenta que en el paso 9 se eliminaron 3 filas, de la cuales, 2 de ellas tenian valores NaN
# en la columna OverTime, por lo tanto, esta columna ya no tiene valores NaN desde el paso 9.

#15. Salvar el dataframe una vez realizado el procesamiento de los puntos anteriores

In [279]:
df14.to_csv('/content/drive/MyDrive/Caso#3/datosProcesados/20210808_cleanData.csv',header=False)